config.org
#+TITLE: Emacs configuration file
#+AUTHOR: Pedro Chagas

* Melpa
#+BEGIN_SRC emacs-lisp
  (require 'package)
  (setq package-enable-at-startup nil)

  (add-to-list 'package-archives
               '("melpa" . "https://melpa.org/packages/"))

  (package-initialize)
#+END_SRC
* Easy Package Management
#+BEGIN_SRC emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
#+END_SRC
* Appearance
** Theme
#+BEGIN_SRC emacs-lisp
  (use-package doom-themes
    :if window-system
    :ensure t
    :config
    ;;(load-theme 'doom-badger t)
    (doom-themes-org-config)
    (doom-themes-visual-bell-config))
  (load-theme 'doom-badger t)
#+END_SRC
** Font
#+BEGIN_SRC emacs-lisp
  ;;(set-face-attribute 'default-frame-alist '(font . "terminus-16"))
  ;;(set-face-attribute 'default nil :font "terminus-16")
  (set-face-attribute 'default nil :height 100)
#+END_SRC
** Lines
#+BEGIN_SRC emacs-lisp
(global-display-line-numbers-mode)
(setq display-line-numbers-type 'relative)
#+END_SRC
* Custom Keybinds
#+BEGIN_SRC emacs-lisp
#+END_SRC
* Better Search
#+BEGIN_SRC emacs-lisp
  (use-package swiper
    :ensure t
    :bind ("C-s" . 'swiper))
#+END_SRC
* Basic Interface Settings
#+BEGIN_SRC emacs-lisp
  (setq use-dialog-box nil)
  (setq use-file-dialog nil)
  (setq make-backup-files nil)
  (setq auto-save-default nil)
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (fringe-mode -1)
  (scroll-bar-mode -1)
  (global-subword-mode 1)
  ;; (defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC
* Startup Dashboard
#+BEGIN_SRC emacs-lisp
  (use-package dashboard
    :ensure t
    :config
    (dashboard-setup-startup-hook)
    (setq dashboard-startup-banner "~/.emacs.d/dashboard-pic.png")
    (setq dashboard-items '((recents  . 5)
                           (bookmarks . 5)))
    (setq dashboard-banner-logo-title "I have become comfortably numb.")) ;; Make script for quotes.

#+END_SRC
* Better Window Switch
#+BEGIN_SRC emacs-lisp
  (use-package switch-window
    :ensure t
    :config
    (setq switch-window-input-style 'minibuffer)
    (setq switch-window-increase 4)
    (setq switch-window-threshold 2)
    (setq switch-window-shortcut-style 'qwerty)
    (setq switch-window-qwerty-shortcuts
          '("a" "s" "d" "f" "j" "k" "l"))
    :bind
    ([remap other-window] . switch-window))
#+END_SRC
* Better Bottom Menu
#+BEGIN_SRC emacs-lisp
  (setq ido-enable-flex-matching t)
  (setq ido-everywhere t)
  (ido-mode 1)

  (use-package ido-vertical-mode
    :ensure t
    :init
    (ido-vertical-mode 1))
  (setq ido-vertical-define-keys 'C-n-and-C-p-only)

  (use-package smex
    :ensure t
    :init (smex-initialize)
    :bind
    ("M-x" . smex))
#+END_SRC  
* Evil mode
#+BEGIN_SRC emacs-lisp
  (use-package evil
    :ensure t)

  (evil-mode 1)
  
#+END_SRC  
* IDE Features
** Language Server Protocol
    #+BEGIN_SRC emacs-lisp
      (use-package lsp-mode
	:ensure t
	:hook
	((python-mode . lsp)))

      (use-package lsp-ui
	:ensure t
	:commands lsp-ui-mode)
     #+END_SRC
** Auto Completion
    #+BEGIN_SRC emacs-lisp
    (use-package company
	:ensure t)
    #+END_SRC
** Error Checking
    #+BEGIN_SRC emacs-lisp
      (use-package flycheck
	:ensure t)
    #+END_SRC
* Language Features
** HTML
#+BEGIN_SRC emacs-lisp
  (use-package emmet-mode
    :ensure t
    :init
    (add-hook 'sgml-mode-hook 'emmet-mode)
    (add-hook 'css-mode-hook  'emmet-mode))
#+END_SRC  
** Python
#+BEGIN_SRC emacs-lisp
  (use-package lsp-pyright
    :ensure t
    :hook (python-mode . (lambda ()
                           (require 'lsp-pyright)
                           (lsp))))
#+END_SRC
* Extra
#+BEGIN_SRC emacs-lisp
(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
#+END_SRC
